<h1 align=ltr style="line-height:200%;font-family:vazir;color:#0099cc">
<font face="vazir" size=6 color="blue" >
Tutorial in Persian
    <br>
    by Reyhane Faraji
    </font>
</h1>

<h1 align=center style="line-height:200%;font-family:vazir;color:#0099cc">
<font face="vazir" size=10 color="maroon" >
PANDAS
</font>
</h1>

In [1]:
import pandas as pd
import numpy as np

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
    دیتا سری (Data Series)
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 ساده ترین ساختمان داده پانداس، دیتاسری، بسیار شبیه آرایه یک بعدی نامپای است. در واقع یک آرایه یک بعدی به همراه نمایه های (index) خاص. راحت ترین راه ایجاد سری استفاده از لیست پایتون است.
</font>
</p>

In [2]:
s_int = pd.Series([1,2,3,4,5])

s_float = pd.Series([1.1, 2.2 ,3.3, 4.4])

s_str = pd.Series(["parsa", "parto", "hamed", "sajjad"])

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
هر سری در کنار آرایه ای از مقادیر، آرایه ای از نمایه هم در خود جای داده است.
</font>
</p>

In [3]:
s_int

0    1
1    2
2    3
3    4
4    5
dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 برای دسترسی به نمایه سری، پانداس ویژگی index و برای مقادیر اصلی، ویژگی values را تعریف کرده است.
</font>
</p>

In [4]:
s_int.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
s_int.values

array([1, 2, 3, 4, 5], dtype=int64)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 اگر به مقادیر به صورت لیست نیاز باشد از تابع to_list استفاده می کنیم.
</font>
</p>

In [6]:
s_int.to_list()

[1, 2, 3, 4, 5]

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 از آنجا که پانداس بر اساس نامپای ساخته شده است، تمام اعمالی که با یک آرایه نامپای انجام دادیم را میتوانیم روی سری پانداس اعمال کنیم.
</font>
</p>

In [7]:
np.max(s_int)

5

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
توابع روی valueها اعمال میشوند و نمایه ها (index) فقط برای آدرس دهی هستند.
</font>
</p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
میتوانیم برای سری نمایه تعریف کنیم. به دو صورت:
    <br>
    همان اول کار، همزمان با تعریف سری
    <br>
    یا با تابع index (با index نمایه های سری تغییر میکند و یک کپی از آن برگردانده نمیشود.)
</font>
</p>

In [8]:
s = pd.Series([19,16,20],index=['a','b','c'])
s

a    19
b    16
c    20
dtype: int64

In [9]:
s.index = ['ali','gholi','vali']
s

ali      19
gholi    16
vali     20
dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 با دستور []s هم میتوانیم به مقدار مربوط به یک نمایه خاص دسترسی پیدا کنیم، هم آن را تغییر دهیم.
</font>
</p>

In [10]:
s['gholi']

16

In [11]:
s['gholi']=20
s

ali      19
gholi    20
vali     20
dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 میتوانیم یک سری را با کمک دیکشنری هم مقداردهی کنیم و بسازیم.
    </font>
</p>

In [12]:
s_dict = {"Ali" : 19 ,"Gholi" : 16 ,"Vali" : 20}
s = pd.Series(s_dict)
s

Ali      19
Gholi    16
Vali     20
dtype: int64

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
    دیتا فریم (DataFrame)
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 ساختار دیتافریم شبیه جدولهای مجموعه داده ها طراحی شده است.
    <br>
     برای ساخت یک دیتافریم میتوانیم هم از دیکشنری و هم از یک لیست ساده استفاده کنیم و با دستور pd.DataFrame آنرا بسازیم.
    </font>
</p>

In [13]:
cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary)

df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 کلیدهای دیکشنری به عنوان اسم سرستونها در دیتافریم استفاده میشوند نه نمایه دیتافریم. سرستونها یا همان کلیدهای دیکشنری با عنوان columns در دیتافریم شناخته میشوند.
    </font>
</p>

In [14]:
df.columns

Index(['model', 'Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
ساختار نمایه در پانداس با type مشخص میشود:
    <br>
    (دقت کنید که این لیست، از نوع object نیست بلکه ساختارداده‌ی خاصی در پانداس است که نمایه‌ها را ذخیره می‌کند)
</font>
</p>

In [15]:
type(df.columns)

pandas.core.indexes.base.Index

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 برای دسترسی یا تغییر نمایه‌های جدول می‌توانیم از ویژگی index مانند آنچه در دیتاسری انجام می‌دادیم استفاده کنیم. لطفا دقت کنید که این نمایه‌ها همان اعداد نشان ‌داده شده در کنار هر سطر هستند و می‌توانند هرمقداری بگیرند.
    </font>
</p>

In [16]:
df.index

RangeIndex(start=0, stop=7, step=1)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر بخواهیم اندیسهای دیتافریم از 1 شروع شوند، از دو دستور زیر میتوانیم استفاده کنیم:
</font>
</p>

In [17]:
df.index +=1
df

           model   Color   HP  Weight (KG)  price
1         Peykan     Red   48          990     33
2         BMW X6   White  335         2320   2400
3    Peugeot 206   Black  105         1025    105
4           Tiba   White   87         1027    120
5  Nissan Junior    Blue   93         1540    230
6   Peykan Vanet     Red   80          960     68
7      renault 5  Silver   48          850     38

In [18]:
df.index = np.arange(1,8)
df

           model   Color   HP  Weight (KG)  price
1         Peykan     Red   48          990     33
2         BMW X6   White  335         2320   2400
3    Peugeot 206   Black  105         1025    105
4           Tiba   White   87         1027    120
5  Nissan Junior    Blue   93         1540    230
6   Peykan Vanet     Red   80          960     68
7      renault 5  Silver   48          850     38

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
    دیتافریم، چند سری به هم چسبیده
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 برای نمایش یک ستون از دیتافریم از دستور ['columns' name']df استفاده میکنیم.
    </font>
</p>

In [19]:
df['Color']

1       Red
2     White
3     Black
4     White
5      Blue
6       Red
7    Silver
Name: Color, dtype: object

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 اگر یک ردیف از دیتافریم را به صورت یک سری تصور کنیم، با دستورهای زیر میتوانیم یک ردیف را صدا بزنیم:
    <br>
    اگر شماره اندیس ردیف را داشته باشیم، از دستور df.iloc[index number] استفاده میکنیم.(در این حالت، نمایه ها نام ستونها هستند)
    <br>
    اگر بخواهیم یک ردیف خاص را با نام صدا کنیم از دستور df.loc['name'] استفاده میکنیم (باید حتما نامی را صدا بزنیم که در دیتافریم به صورت نمایه تعریف شده باشد).
    </font>
</p>

In [20]:
df.iloc[0] # it returns the row with index 0

model          Peykan
Color             Red
HP                 48
Weight (KG)       990
price              33
Name: 1, dtype: object

In [21]:
#df.loc['Peykan'] #if we put peykan as index this would be right

<img src='./2.pandas_file/01.jpg'/>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 برای دسترسی به تمامی مقادیر یک دیتافریم به صورت یک آرایه نامپای میتوانیم از value استفاده کنیم.
    </font>
</p>

In [22]:
df.values

array([['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Peykan Vanet', 'Red', 80, 960, 68],
       ['renault 5', 'Silver', 48, 850, 38]], dtype=object)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای تبدیل دیتافریم به سری از دستور pd.Series استفاده میکنیم.
    <br>
    ستونی که قرار است به عنوان value باشد را به صورت df['col2'].values و ستونی که قرا است به عنوان اندیس باشد را با دستور index=df['col1'] مشخص میکنیم

In [23]:
new_series = pd.Series(df['price'].values, index=df['model'])
new_series

model
Peykan             33
BMW X6           2400
Peugeot 206       105
Tiba              120
Nissan Junior     230
Peykan Vanet       68
renault 5          38
dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای از بین بردن اسامی در سری از دو دستور زیر استفاده میکنیم:

In [24]:
new_series.name=None
new_series.index.name=None
new_series

Peykan             33
BMW X6           2400
Peugeot 206       105
Tiba              120
Nissan Junior     230
Peykan Vanet       68
renault 5          38
dtype: int64

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
    ساخت دیتافریم با لیست
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 ساخت دیتافریم با استفاده از لیست بسیار شبیه ساخت آن با دیکشنری است. به طوری که هر ردیف دیتافریم در یک لیست قرار میگیرد و تمام لیستهای ردیف باز به صورت لیست آورده میشوند.
    </font>
</p>

In [25]:
car_list = [['Peykan', 'Red', 48, 990, 33],
       ['BMW X6', 'White', 335, 2320, 2400],
       ['Peugeot 206', 'Black', 105, 1025, 105],
       ['Tiba', 'White', 87, 1027, 120],
       ['Nissan Junior', 'Blue', 93, 1540, 230],
       ['Nissan Junior', 'Red', 93, 1540, 186],
       ['renault 5', 'Silver', 48, 850, 38]]
df2 = pd.DataFrame(car_list)
df2

               0       1    2     3     4
0         Peykan     Red   48   990    33
1         BMW X6   White  335  2320  2400
2    Peugeot 206   Black  105  1025   105
3           Tiba   White   87  1027   120
4  Nissan Junior    Blue   93  1540   230
5  Nissan Junior     Red   93  1540   186
6      renault 5  Silver   48   850    38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 با این دستور سرستونها و نمایه ها از 0 تا (L-1) مقداردهی میشوند.
    <br>
    با استفاده از دستورهای index , columns میتوانیم مقادیر نمایه و ستونها را چه در هنگام تعریف دیتافریم چه بعد از آن، تغییر دهیم.
    </font>
</p>

In [26]:
df2 = pd.DataFrame(car_list, 
                  index = ['a','b','c','d','e','f','g'],
                  columns= ['model' , 'Color' , 'HP', 'Weight (KG)', 'price'])
df2

           model   Color   HP  Weight (KG)  price
a         Peykan     Red   48          990     33
b         BMW X6   White  335         2320   2400
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 ساخت دیتافریم با استفاده از 2 لیست که یکی به عنوان اندیس باشد:
    </font>
</p>

In [27]:
name = ['Ali', 'Sara', 'Ahmad']
age = [32, 45, 50]
df3 = pd.DataFrame(age, index = name, columns = ['age'])
df3

       age
Ali     32
Sara    45
Ahmad   50

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    میتوانیم اسم ستون را متفاوت با اسم لیست داده شده انتخاب کنیم.
</font>
</p>

In [28]:
df3 = pd.DataFrame(age, index = name, columns = ['Age'])
df3

       Age
Ali     32
Sara    45
Ahmad   50

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 با دستور replace میتوانیم مقدار ستونها را تغییر دهیم.
    <br>
    پارامتر inplace اگر True باشد،  تغییرات را در دیتافریم اولیه اعمال میکند.
    </font>
</p>

In [29]:
df3['Age'].replace({32:40})

Ali      40
Sara     45
Ahmad    50
Name: Age, dtype: int64

In [30]:
df3

       Age
Ali     32
Sara    45
Ahmad   50

In [31]:
df3['Age'].replace({32:40},inplace=True)
df3

       Age
Ali     40
Sara    45
Ahmad   50

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
    بررسی دیتافریم
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 دیتافریم ماشینها را در نظر بگیرید؛ با استفاده از تابع head چند سطر اول (پیشفرض 5 تا) و با استفاده از تابع tail چند سطر آخر را میتوانیم ببینیم.
    </font>
</p>

In [32]:
df2.head(3)

         model  Color   HP  Weight (KG)  price
a       Peykan    Red   48          990     33
b       BMW X6  White  335         2320   2400
c  Peugeot 206  Black  105         1025    105

In [33]:
df2.tail()

           model   Color   HP  Weight (KG)  price
c    Peugeot 206   Black  105         1025    105
d           Tiba   White   87         1027    120
e  Nissan Junior    Blue   93         1540    230
f  Nissan Junior     Red   93         1540    186
g      renault 5  Silver   48          850     38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر چند تا از سطرهای وسط را بخواهیم از [] استفاده میکنیم.
    <br>
    از سطر x تا یکی قبل از y:

In [34]:
# df2[x:y]
df2[1:4]

         model  Color   HP  Weight (KG)  price
b       BMW X6  White  335         2320   2400
c  Peugeot 206  Black  105         1025    105
d         Tiba  White   87         1027    120

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 برای انتخاب چند سطر تصادفی از تابع sample استفاده میکنیم.
    </font>
</p>

In [35]:
df2.sample(4, random_state = 42)

           model  Color   HP  Weight (KG)  price
a         Peykan    Red   48          990     33
b         BMW X6  White  335         2320   2400
f  Nissan Junior    Red   93         1540    186
c    Peugeot 206  Black  105         1025    105

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
   پارامتر random_state، مانند تمامی توابع تصادفی دیگر در پایتون برای ثابت نگاه داشتن خروجی آن استفاده شده است تا در صورتی که شما این تابع را اجرا کردید نیز، خروجی مشابهی بگیرید.
    <br>
مقدار 4 در واقع پارامتر n در این تابع را مقداردهی می‌کند که به معنی برداشت ۴ سطر تصادفی از دیتافریم df2 است. 
</font>
</p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 در صورتی که تعداد سطر‌ها برای ما مشخص نباشد و بخواهیم درصد خاصی از آن‌ها را جدا کنیم می‌توانیم به جای مقدار‌دهی پارامتر n از پارامتر frac استفاده کنیم.
    </font>
</p>

In [36]:
df2.sample(frac=0.4 , random_state = 42)

           model  Color   HP  Weight (KG)  price
a         Peykan    Red   48          990     33
b         BMW X6  White  335         2320   2400
f  Nissan Junior    Red   93         1540    186

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
به دلیل انتخاب تصادفی، نمایه ها به ترتیب نخواهند بود. برای دوباره نویسی نمایه از پارامتر ignore_index استفاده میکنیم و مقدار آن را برابر با True قرار میدهیم.
    </font>
</p>

In [37]:
df2.sample(frac=0.4, ignore_index=True , random_state = 42)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     33
1         BMW X6  White  335         2320   2400
2  Nissan Junior    Red   93         1540    186

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای داشتن یک دید کلی از دیتافریم از دو تابع info , describe استفاده میکنیم.
     </font>
</p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    خروجی تابع info()، تمامی ساختار دیتافریم را برای ما نشان می‌دهد.برای تمامی ستون‌ها، می‌توانیم نوع مقادیر Dtype را مشاهده کنیم. به طور معمول مقادیر عددی را به صورت int یا float در نظر می‌گیریم مگر آن‌که این ستون حاوی مقادیر خالی (null) باشد.
    </font>
</p>

In [38]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a to g
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   model        7 non-null      object
 1   Color        7 non-null      object
 2   HP           7 non-null      int64
 3   Weight (KG)  7 non-null      int64
 4   price        7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 336.0+ bytes

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
برای پیدا کردن تعداد سطرها و ستون‌ها از دستور زیر استفاده می‌کنیم:
    </font>
</p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    </font>
    </div>

```python
count_row = df.shape[0]  # Gives number of rows
count_col = df.shape[1]  # Gives number of columns
```
</p>

In [39]:
count_row = df2.shape[0]  # Gives number of rows
count_col = df2.shape[1]  # Gives number of columns
print(count_row,count_col)

7 5

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    تابع describe مشخصات آماری دیتافریم را به ما میدهد.(تنها روی ستونهایی که مقادیر عددی دارند اعمال میشود.)
    </font>
</p>

In [40]:
df2.describe()

               HP  Weight (KG)        price
count    7.000000     7.000000     7.000000
mean   115.571429  1327.428571   444.571429
std     99.354344   516.250539   865.250225
min     48.000000   850.000000    33.000000
25%     67.500000  1007.500000    71.500000
50%     93.000000  1027.000000   120.000000
75%     99.000000  1540.000000   208.000000
max    335.000000  2320.000000  2400.000000

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
با دستور loc میتوانیم هر کدام از مقادیر را فراخوانی کنیم.
    </font>
</p>

In [41]:
df2.describe().loc['75%']

HP               99.0
Weight (KG)    1540.0
price           208.0
Name: 75%, dtype: float64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای محاسبه max , min یک ستون مانند دستورات نامپای عمل میکنیم و تابع max , min را روی ستون اعمال میکنیم.
    </font>
</p>

In [42]:
n_max = df2['HP'].max()
n_max

335

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای بررسی یک ستون و دیدن مقادیر یکتای آن از دستور unique استفاده میکنیم.

In [43]:
df2['Color'].unique()

array(['Red', 'White', 'Black', 'Blue', 'Silver'], dtype=object)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر بخواهیم علاوه بر داده های یونیک یک ستون تعداد هر کدام هم بشماریم از دستور value_counts روی هر ستون به طور مستقل استفاده میکنیم.    
    </font>
</p>

In [44]:
df2['Color'].value_counts()

Red       2
White     2
Black     1
Blue      1
Silver    1
Name: Color, dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر بخواهیم یک مقدار خاص را در ستون بشماریم با [] جلوی دستور قرار میدهیم.
    </font>
</p>

In [45]:
df2['Color'].value_counts()['Red']

2

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
برای مرتب کردن مقادیر میتوانیم از پارامتر ascending استفاده کنیم.
    <br>
    اگر مقدار پارامتر را True قرار دهیم مقادیر را صعودی مرتب میکند و اگر False قرار دهیم، نزولی. 
    </font>
</p>

In [46]:
df2['Color'].value_counts(ascending=True)

Black     1
Blue      1
Silver    1
Red       2
White     2
Name: Color, dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای مرتب کردن یک سری از دستور sort_values میتوانیم استفاده کنیم (پارامتر ascending به طور پیشفرض True است).
    </font>
</p>

In [47]:
df2['price'].sort_values()

a      33
g      38
c     105
d     120
f     186
e     230
b    2400
Name: price, dtype: int64

In [48]:
df2['price'].sort_values(ascending=False)

b    2400
e     230
f     186
d     120
c     105
g      38
a      33
Name: price, dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای چک کردن یک حرف یا یک لغت در مقادیر رشته ای یک ستون از دستور (' ')df.col_name.str.contains استفاده میکنیم.
    <font>
    </p>

In [49]:
R_df2 = df2[df2.Color.str.contains('R')]
R_df2

           model Color  HP  Weight (KG)  price
a         Peykan   Red  48          990     33
f  Nissan Junior   Red  93         1540    186

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر یک لیست داشته باشیم که بخواهیم چک کنیم اسامی در یک ستون در آن لیست قرار دارد یا خیر، ابتدا لیست را تعریف میکنیم. یک پارامتر به شکل

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>

```python
parameter = '|'.join(mylist)
```
<p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>  
    تعریف میکنیم و این پارامتر را در مقابل contains قرار میدهیم.

In [50]:
mylist=['Red','White']
parameter = '|'.join(mylist)
list_df2 = df2[df2.Color.str.contains(parameter)]
list_df2

           model  Color   HP  Weight (KG)  price
a         Peykan    Red   48          990     33
b         BMW X6  White  335         2320   2400
d           Tiba  White   87         1027    120
f  Nissan Junior    Red   93         1540    186

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
کار با دیتافریم
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
دیتافریم ماشینها را در نظر میگیریم و این بار نام ماشینها را به عنوان اندیس قرار میدهیم.
    </font>
</p>

In [51]:
cars_dictionary = {
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary , index = [ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"])

df

                Color   HP  Weight (KG)  price
Peykan            Red   48          990     33
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
Peykan Vanet      Red   80          960     68
renault 5      Silver   48          850     38

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
نمایه‌سازی ستون‌ها
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای دسترسی به یک ستون از دستور df['name'] یا df.name استفاده میکنیم. در حالت دوم اگر اسم ستون فاصله داشته باشد یا برابر با یکی از کلمات رزرو شده پایتون باشد یا بخواهیم روی نامها iteration انجام دهیم، توصیه نمیشود.    </font>
</p>

In [52]:
df['Color']

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

In [53]:
df.Color

Peykan              Red
BMW X6            White
Peugeot 206       Black
Tiba              White
Nissan Junior      Blue
Peykan Vanet        Red
renault 5        Silver
Name: Color, dtype: object

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر بخواهیم به جای یک ستون، چند ستون‌ را بازیابی کنیم، باید اسم ستون‌ها را درون یک لیست گذاشته و سپس آن لیست را درون براکت ([ ])، روبروی اسم تابع بنویسیم.
    <br>
    دیتافریم بدست آمده یک زیرمجموعه از دیتافریم اصلی است که با تغییر هر کدام دیگری دچار تغییر میشود.
    </font>
</p>

In [54]:
df[["Color" , "price"]]

                Color  price
Peykan            Red     33
BMW X6          White   2400
Peugeot 206     Black    105
Tiba            White    120
Nissan Junior    Blue    230
Peykan Vanet      Red     68
renault 5      Silver     38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
پیموندن (iterate) نام ستون‌ها:
    <br>
    با استفاده از ویژگی df.columns، می‌توانیم به لیستی شامل نام ستون‌ها دسترسی پیدا کنیم.
    </font>
</p>

In [55]:
df.columns

Index(['Color', 'HP', 'Weight (KG)', 'price'], dtype='object')

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
نمایه‌سازی سطر‌ها
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای دسترسی به سطر‌های دیتافریم، می‌توانیم از دو روش loc و iloc استفاده کنیم. هر دو این توابع، از نمایه‌ی (index) دیتافریم برای آدرس‌دهی استفاده می‌کنند؛ اما در تابع iloc، از شماره‌ی نمایه، مانند لیست نامپای، برای آدرس‌دهی استفاده می‌شود در حالی که در تابع loc، دقیقا همان نام نمایه را برای نمایه‌سازی استفاده می‌کنیم.
    </font>
</p>

In [56]:
df.iloc[2]

Color          Black
HP               105
Weight (KG)     1025
price            105
Name: Peugeot 206, dtype: object

In [57]:
df.loc["Tiba"]

Color          White
HP                87
Weight (KG)     1027
price            120
Name: Tiba, dtype: object

<img src='./2.pandas_file/02.jpg'/>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
نکته:
    <br>
دقت کنید که تفاوت loc و iloc، تنها در حالتی است که دیتافریم، دارای نمایه‌های تعریف شده‌ای باشد. در غیر این صورت نام نمایه‌ها با شماره‌ی آن‌ها برابر است و برای آدرس دهی استفاده از هر دو تابع مشابه خواهد بود.
    </font>
</p>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
نمایه‌سازی با دیدگاه مبتنی بر آرایه‌ی دوبعدی
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با مقداردهی دو تابع loc , iloc میتوانیم به یک عنصر یا بخشی از یک دیتافریم دسترسی پیدا کنیم.
    </font>
</p>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    فراخوانی سطر شماره 2 و ستون شماره 3:
    </font>
</p>

In [58]:
df.iloc[2,3]

105

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
    فراخوانی سطرهای شماره 2 و 3 ستونهای شماره 1 تا 3 (شامل خود 3 نمیشود):
    </font>
</p>

In [59]:
df.iloc[[2,3], 1:3]

              HP  Weight (KG)
Peugeot 206  105         1025
Tiba          87         1027

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
از سطر اول تا 2 تا مانده به آخر، 2 تا 2 تا:  
    </font>
</p>

In [60]:
df.iloc[:-2:2]

               Color   HP  Weight (KG)  price
Peykan           Red   48          990     33
Peugeot 206    Black  105         1025    105
Nissan Junior   Blue   93         1540    230

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
ردیف Tiba و ستون price:  
    </font>
</p>

In [61]:
df.loc['Tiba','price']

120

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
سطر Tiba و Peugeot 206، ستون HP تا price: 
    </font>
</p>

In [62]:
df.loc[["Peugeot 206","Tiba"] , "HP":"price"]

              HP  Weight (KG)  price
Peugeot 206  105         1025    105
Tiba          87         1027    120

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
* در حالت iloc از 1:3، خود ستون سوم شامل نمیشود. ولی در حالت loc[ , "HP":"price"]، ستون price شامل میشود.
    </font>
</p>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
اعمال تغییرات روی دیتافریم
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای تغییر نام ستونها از دستور df.rename استفاده میکنیم. اگر بخواهیم دیتافریم جدید جایگزین اولی شود، پارامتر inplace را برابر True قرار میدهیم.
    </font>
</p>

In [63]:
df2.rename(columns={'price':'Car Price','Color':'Car_Color'}, inplace=True)
df2

           model Car_Color   HP  Weight (KG)  Car Price
a         Peykan       Red   48          990         33
b         BMW X6     White  335         2320       2400
c    Peugeot 206     Black  105         1025        105
d           Tiba     White   87         1027        120
e  Nissan Junior      Blue   93         1540        230
f  Nissan Junior       Red   93         1540        186
g      renault 5    Silver   48          850         38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای اضافه کردن یک ستون جدید به دیتافریم، آن را داخل [] قرار میدهیم.
    </font>
</p>

In [64]:
df2['new column']=df2['Car Price']*1000
df2

           model Car_Color   HP  Weight (KG)  Car Price  new column
a         Peykan       Red   48          990         33       33000
b         BMW X6     White  335         2320       2400     2400000
c    Peugeot 206     Black  105         1025        105      105000
d           Tiba     White   87         1027        120      120000
e  Nissan Junior      Blue   93         1540        230      230000
f  Nissan Junior       Red   93         1540        186      186000
g      renault 5    Silver   48          850         38       38000

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای جایگزینی یک کاراکتر با یک کاراکتر دیگر در نام ستونها از دستور replace استفاده میکنیم.
    </font>
</p>

In [65]:
df2.columns.str.replace(' ','-')
df2

           model Car_Color   HP  Weight (KG)  Car Price  new column
a         Peykan       Red   48          990         33       33000
b         BMW X6     White  335         2320       2400     2400000
c    Peugeot 206     Black  105         1025        105      105000
d           Tiba     White   87         1027        120      120000
e  Nissan Junior      Blue   93         1540        230      230000
f  Nissan Junior       Red   93         1540        186      186000
g      renault 5    Silver   48          850         38       38000

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای حذف سطرهایی با شرط خاص و نگه داشتن بقیه سطرهای دیتافریم از ~ استفاده میکنیم.
    <br>
    مثلا برای حذف سطرهایی که حرف R را در ستون Color دارند و نگه داشتن بقیه سطرها:  
    </font>
</p>

In [66]:
no_R_df = df[~df['Color'].str.contains('R',na=False)]
no_R_df

                Color   HP  Weight (KG)  price
BMW X6          White  335         2320   2400
Peugeot 206     Black  105         1025    105
Tiba            White   87         1027    120
Nissan Junior    Blue   93         1540    230
renault 5      Silver   48          850     38

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
انتخاب شرطی
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با کمک برخی ویژگیها و توابع میتوانیم بخشی از یک دیتافریم را فیلتر کنیم. مثلا با دستور df.name>x اینکه مقادیر یک ستون از عدد x  بزرگتر است را بررسی می کنیم. 
    </font>
</p>

In [67]:
df.price > 110

Peykan           False
BMW X6            True
Peugeot 206      False
Tiba              True
Nissan Junior     True
Peykan Vanet     False
renault 5        False
Name: price, dtype: bool

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با دستور df[df.name>x] کل دیتافریم را فیلتر میکنیم و بخشی از دیتافریم که این ویژگی را دارد به ما میدهد.
    </font>
</p>

In [68]:
df[df.price > 110]

               Color   HP  Weight (KG)  price
BMW X6         White  335         2320   2400
Tiba           White   87         1027    120
Nissan Junior   Blue   93         1540    230

<img src='./2.pandas_file/03.jpg'/>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
عملیات منطق بولی
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
میتوان برای دو ستون شرط گذاشت. با وی بیتی یا یای بیتی.
    </font>
</p>

In [69]:
df[ (df.Color == "Red") & (df.price < 50)]

       Color  HP  Weight (KG)  price
Peykan   Red  48          990     33

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
میتوانیم شرطهای مختلف را با عنوان condition ذخیره کنیم و با فیلترهای متفاوت استفاده کنیم. حتما هنگام شرط گذاری باید به پرانتزها دقت شود.
    </font>
</p>

In [70]:
condition_1 = df.Color == "Red"
condition_2 = df.Color == "White"
condition_3 = df.HP < 100

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
شرط اول را داشته باشد یا شرط 2 و 3 همزمان:
    </font>
</p>

In [71]:
df[(condition_1) | ((condition_2) & condition_3)]

              Color  HP  Weight (KG)  price
Peykan          Red  48          990     33
Tiba          White  87         1027    120
Peykan Vanet    Red  80          960     68

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
* برای اضافه کردن یک ستون با شرایط و مقادیر خاص بر اساس ستونهای قبلی از دستور np.select(conditions,values) استفاده میکنیم و شرایط و مقادیر را به صورت لیست قرار میدهیم.

In [72]:
df['price_range']=np.select([(df['price']<100),
                             (df['price']>=100) & (df['price']<1000),
                             (df['price']>=1000)],
                           ['<100', '100-1000', '>=1000'])
df

                Color   HP  Weight (KG)  price price_range
Peykan            Red   48          990     33        <100
BMW X6          White  335         2320   2400      >=1000
Peugeot 206     Black  105         1025    105    100-1000
Tiba            White   87         1027    120    100-1000
Nissan Junior    Blue   93         1540    230    100-1000
Peykan Vanet      Red   80          960     68        <100
renault 5      Silver   48          850     38        <100

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
کار با فایل
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در دنیای واقعی، داده‌ها در فرمت‌های متفاوتی ذخیره شده‌اند و ما باید بتوانیم از ابزارهای گوناگونی استفاده کنیم تا به داده‌های بیشتری دست پیدا کنیم. قسمتی از داده‌ها در فضای وب توزیع شده‌اند؛ بخشی دیگر از داده‌ها را می‌توانیم از فایل‌های متنی بازیابی کنیم؛ داده‌های بسیار زیادی در پایگاه‌های داده (Databases) ذخیره شده‌اند و مقداری دیگر از داده‌ها به کمک APIها قابل دسترس هستند. 
    </font>
</p>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
خواندن از فایل CSV
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با تابع pd.read_csv('file_name') فایل csv را میخوانیم.
    <br>
    در این دستور فایلی که فراخوانی میکنیم باید در همان فولدری که برنامه قرار دارد باشد. اگر قبل از نام فایل ./ اضافه شود داخل همان فولدر میتوانیم نام یک فولدر دیگر را بدهیم. اگر فولدر حاوی فایل csv کنار برنامه نباشد با هر نقطه که پشت / اضافه میشود، یک فولدر به عقب برمیگردیم و میتوانیم آدرس فایل را به ترتیب بنویسیم.
    </font>
</p>

In [73]:
df = pd.read_csv('./2.pandas_file/population.csv')
df

                                         Race  Population (2020) Percentage
0                            Total population            5706494       100%
1                  White or European American            4423146      77.5%
2                   Black or African American             398434       7.0%
3                             Native American              68641       1.2%
4                              Asian American             299190       5.2%
5  Native Hawaiian and Other Pacific Islander               2918       0.1%
6                             Some other race             168444       3.0%
7                           Two or more races             345721       6.1%

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
به طور پیش فرض اعداد و اطلاعات در فایل csv با استفاده از کاما , از هم جدا شده اند. حال اگر کاما نبود باید با دستور sep مشخص کنیم که از کجا جدا کند و یتون جدید را برای ما بسازد.
    <br>
    مثلا اگر اطلاعات با ; جدا شده باشند:

In [74]:
# df = pd.read_csv('./2.pandas_file/population.csv',sep=':')

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
میتوانیم برای ستونها با پارامتر names اسم گذاری کنیم. names یک لیست از اسامی ستون هاست و تعداد اسامی در این لیست باید با تعداد ستونها برابر باشد. اسامی در این لیست باید در ' ' قرار بگیرند.

In [75]:
df = pd.read_csv('./2.pandas_file/population.csv', names=['Race_e','Population (2020)_e','Percentage_e'])
df

                                       Race_e Population (2020)_e Percentage_e
0                                        Race   Population (2020)   Percentage
1                            Total population             5706494         100%
2                  White or European American             4423146        77.5%
3                   Black or African American              398434         7.0%
4                             Native American               68641         1.2%
5                              Asian American              299190         5.2%
6  Native Hawaiian and Other Pacific Islander                2918         0.1%
7                             Some other race              168444         3.0%
8                           Two or more races              345721         6.1%

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر فایل csv شامل کاراکترهایی باشد که قابل خواندن برای پانداس نیست، باید با پارامتر encoding، از یک انکدر استفاده کنیم که فایل را پشتیبانی کند.
    <br>
    مثلا انکدر 'gbk' از کاراکترهای چینی پشتیبانی میکند.

In [76]:
# df = pd.read_csv('china_house.csv',encoding='gbk')

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
* هنگام ذخیره در فایل هم باید از انکدر استفاده کنیم.

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
خواندن از فایل Excel
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با تابع pd.read_excel('file_name') فایل Excel را میخوانیم.

[Function's Document](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
        خواندن از HTML

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در پانداس برای خواندن HTML تابع read_html تعریف شده‌است. پیش از معرفی این تابع لازم است بگوییم مبحث استخراج داده از وب بسیار پرکاربرد و البته گسترده است. ابزارهای پیشرفته‌ای مانند scrapy و selenium و beautiful soup به این منظور طراحی و پیاده‌سازی شده‌اند.

[Selenium documents, ](https://selenium-python.readthedocs.io/)
[Scrapy, ](https://docs.scrapy.org/en/latest/intro/tutorial.html)
[Beautiful Soup, ](https://www.crummy.com/software/BeautifulSoup/bs4/doc/)

In [77]:
caption = "Racial composition of the population of Minnesota"

# df = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match=caption)[0]
# df

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
نوشتن در فایل CSV

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
هر دیتافریم یک تابع to_csv دارد که به شکل زیر می‌توانیم از آن استفاده کنیم.
    <br>
DataFrame.to_csv(path, index=True)
    <br>
مسیری که می‌خواهیم فایل را در آن ذخیره کنیم را در قالب یک رشته در آرگومان path می‌نویسیم.
    <br>
آرگومان index مقادیر بولی می‌پذیرد. اگر True باشد (حالت پیش‌فرض) نمایه (index) سطرها را نیز در فایل ذخیره می‌کند. اگر False باشد، نمایه سطر‌ها را در فایل ذخیره نمی‌کند.

In [78]:
df.to_csv('./2.pandas_file/population2.csv', index=False)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در بازار کار بیشتر از SQL استفاده می‌شود. یعنی تحلیل‌گران داده حرفه‌ای داده‌ مورد نیاز خود را با کوئری زدن به دیتابیس‌ها استخراج می‌کنند.

[read SQL](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

[to SQL](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
اِعمال توابع و مرتب‌سازی
    </font>
</div>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
تابع apply
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با گرفتن یک تابع یا عبارت لامدا (lambda expression) آن را روی ستونها (پیش فرض) (axis = 0) یا روی سطرها (axis = 1) اعمال میکند.

<h2 align=right style="line-height:200%;font-family:vazir;color:#0099cc">
<font face="vazir" color="#0099cc">
    <code>apply</code> پارامترهای مهم تابع

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
    </font>
    </div>
    
```python
DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)
```   
</p>

<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=3>

| پارامتر     | توضیح |
| ----------- | ----------- |
| func        | تابعی که قصد داری روی دیتافریم اعمال کنیم.                                                                                                                                                                                                                                       |
| axis        | - اگر 0 باشد تابع روی هر ستون اعمال می‌شود. پیش‌فرض 0 است.<br>- اگر 1 باشد تابع روی هر سطر اعمال می‌شود.                                                                                                                                                                         |
| raw         | - اگر False باشد جنس سطر یا ستون ورودی func، دیتاسری خواهد بود. مقدار پیش‌فرض این پارامتر False است.<br>- اگر True باشد جنس سطر یا ستون ورودی func، آرایه نامپای خواهد بود. اگر func یکی از توابع نامپای باشد به دلیل بهبود عملکرد (performance) بهتر است raw را True قرار دهیم. |
| args        | پارامتر‌های موقعیتی (positional arguments) که تابع func می‌پذیرد.                                                                                                                                                                                                                |
| kwargs      | پارامتر‌های کلیدواژه‌ای (keyword arguments) که تابع func می‌پذیرد.                                                                                                                                                                                                               |
| result_type | جنس خروجی را مشخص می‌کند و فقط در صورتی مورد توجه قرار می‌گیرد که `axis=0‍` باشد. می‌تواند سه مقدار expand، reduce و broadcast را داشته باشد.                                                                                                                                    |

</font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
یک دیتافریم داریم و میخواهیم جمع عناصر هر سطر را حساب کنیم:
    <br>
    تابع sum_row را طوری تعریف می‌کنیم که یک دیتاسری به اسم row ورودی بگیرد و مقادیری که کلیدهایشان col_1 و col_2 است را با هم جمع کند.

In [79]:
df = pd.DataFrame()
df['col_1'] = [1,4,9,16]
df['col_2'] = [25,36,49,64]
df

   col_1  col_2
0      1     25
1      4     36
2      9     49
3     16     64

In [80]:
def sum_row (row) :
    return row['col_2'] + row['col_1']

df['sum'] = df.apply(sum_row, axis=1)
df

   col_1  col_2  sum
0      1     25   26
1      4     36   40
2      9     49   58
3     16     64   80

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
 می‌توان با کمک عبارت لامدا نیز جمع المان‌های هر سطر را به دست آورد.

In [81]:
df.drop(['sum'], axis=1, inplace=True) # Delete the previous column sum
df['sum'] = df.apply(lambda row : row['col_1'] + row['col_2'], axis=1)
df

   col_1  col_2  sum
0      1     25   26
1      4     36   40
2      9     49   58
3     16     64   80

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
جمع عناصر ستونهای یک دیتافریم:

In [82]:
df.drop(['sum'], axis=1, inplace=True)
df.apply(np.sum)

col_1     30
col_2    174
dtype: int64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
می خواهیم تمام عناصر یک دیتافریم را بر 2 تقسیم کنیم. این کار را به چهار روش میتوانیم انجام دهیم.

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
روش اول: تابع row_divide_2 را تعریف می‌کنیم و با استفاده از apply آن را سطر به سطر روی دیتافریم اعمال می‌کنیم.

In [83]:
def row_divide_2 (row) :
  return row / 2 
df.apply(row_divide_2, axis=1)

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
روش دوم: تابع col_divide_2 را تعریف می‌کنیم و با اعمال ستون به ستون آن، همه المان‌ها را بر ۲ تقسیم می‌کنیم.

In [84]:
def col_divide_2 (col) : 
    return col / 2 

df.apply(col_divide_2)

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
روش سوم: از لامدا کمک میگیریم و تابع جدا تعریف نمیکنیم.

In [85]:
df.apply(lambda x : x/2)

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
روش چهارم: بدون استفاده از apply:

In [86]:
df/2

   col_1  col_2
0    0.5   12.5
1    2.0   18.0
2    4.5   24.5
3    8.0   32.0

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
تابع sort_values
    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
این تابع با ورودی گرفتن اسم ستونی که می‌خواهیم بر اساسش مرتب‌سازی انجام دهیم، دیتافریم را مرتب می‌کند. اسم ستون دلخواه را باید در پارامتر by این تابع بنویسیم.
    <br>
    اگر مقدار پارامتر ascending را True قرار دهیم مقادیر را صعودی مرتب میکند و اگر False قرار دهیم، نزولی.

<h2 align=right style="line-height:200%;font-family:vazir;color:#0099cc">
<font face="vazir" color="#0099cc">
    <code>sort_values</code> پارامترهای مهم تابع

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
    </font>
    </div>
    
```python
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort',na_position='last',\
                      ignore_index=False, key=None)
```   
</p>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=3>
        
| پارامتر| توضیحات|
| ------------ |-------- |
| by| می‌تواند اسم ستون یا نمایه سطر باشد. اگر بخواهیم چندین ستون یا چندین سطر را برای مرتب‌سازی در نظر بگیریم می‌توانیم لیست اسامی ستون‌ها را به این پارامتر پاس بدهیم.|
| axis| نوع مرتب‌سازی را مشخص می‌کند که بر اساس سطر باشد یا ستون.<br><br><br>- اگر 0 باشد مرتب‌سازی ستونی است.<br>- اگر 1 باشد مرتب‌سازی سطری است.|
| ascending| دو مقدار True یا False را می‌تواند داشته باشد.<br><br>- اگر False باشد مرتب‌سازی نزولی است. مقدار پیش‌فرض False است.<br>- اگر True باشد مرتب‌سازی صعودی است.|
| inplace| دو مقدار True یا False را می‌تواند داشته باشد.<br><br>- اگر مقدار این پارامتر True باشد، نتیجه مرتب‌سازی درون دیتا‌فریم اصلی کپی می‌شود.<br>- اگر False باشد یک نسخه مرتب‌شده از دیتافریم را return می‌کند.|
| kind| الگوریتم مرتب‌سازی را مشخص‌ می‌کند. به صورت پیش‌فرض روی quicksort تنظیم شده است.|
| na_position  | محل قرارگیری NaN (Not a Number) ها را در فریم مرتب‌شده مشخص می‌کند.<br><br>- اگر last باشد در آخرین سطر‌ها قرار می‌گیرند. پیش‌فرض این پارامتر last است.<br>- اگر first باشد در سطرهای ابتدایی قرار می‌گیرند.|
| ignore_index | چون ممکن است پس از مرتب‌سازی نمایه‌ها جابه‌جا شوند (مثلا نمایه 0 مربوط به اولین سطر نباشد)، می‌توانیم با این پارامتر نمایه‌ها را بازآرایی کنیم.<br><br>- اگر True باشد، نمایه سطرهای مرتب‌شده از 0 تا L -1 خواهد بود که L تعداد سطرهای آرایه‌است. <br>- اگر False باشد، هر سطر نمایه پیش از مرتب‌سازی را حفظ می‌کند. |
| key| تابعی که پیش از مرتب‌سازی، روی عناصر موجود در سطرها یا ستون‌هایی که در `by` وجود دارد، اعمال می‌شود. در مثال‌ها بیشتر با این کارکرد این پارامتر آشنا می‌شویم.|
        
<div>

In [87]:
stu_dictionary = {
    "name" : ["PARTO", "parsa", "SAJJAD", "hadi", "MOHSEN", "ghazale", "hamed"] ,
    "stu_number" : ["963613060", "963613061", "963613062", "963613063", "963613064", "963613065", "933613080"] ,
    "average" : [19.68,19.90,17.27, 19.5, 15.9, 18.2, 19.34]
}
df = pd.DataFrame(stu_dictionary)
df

      name stu_number  average
0    PARTO  963613060    19.68
1    parsa  963613061    19.90
2   SAJJAD  963613062    17.27
3     hadi  963613063    19.50
4   MOHSEN  963613064    15.90
5  ghazale  963613065    18.20
6    hamed  933613080    19.34

In [88]:
df.sort_values(by='average', ascending=False)

      name stu_number  average
1    parsa  963613061    19.90
0    PARTO  963613060    19.68
3     hadi  963613063    19.50
6    hamed  933613080    19.34
5  ghazale  963613065    18.20
2   SAJJAD  963613062    17.27
4   MOHSEN  963613064    15.90

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر بخواهیم بر اساس name مرتب سازی را انجام دهیم، با دستور df.sort_values('name') اول اسامی با حروف بزرگ را مرتب میکند بعد اسامی با حروف کوچک. برای رفع این مشکل ابتدا کل اسامی را به حروف کوچک تبدیل میکنیم.
    <br>
    می‌توانیم از پارامتر key تابع sort_values استفاده کنیم. این پارامتر با دریافت یک تابع یا یک عبارت لامدا، پیش از انجام مرتب‌سازی آن را روی ستون‌هایی که در پارامتر by آمده است، اعمال می‌کند.

In [89]:
df.sort_values('name')

      name stu_number  average
4   MOHSEN  963613064    15.90
0    PARTO  963613060    19.68
2   SAJJAD  963613062    17.27
5  ghazale  963613065    18.20
3     hadi  963613063    19.50
6    hamed  933613080    19.34
1    parsa  963613061    19.90

In [90]:
df.sort_values(by='name', key=lambda name : name.str.lower())

      name stu_number  average
5  ghazale  963613065    18.20
3     hadi  963613063    19.50
6    hamed  933613080    19.34
4   MOHSEN  963613064    15.90
1    parsa  963613061    19.90
0    PARTO  963613060    19.68
2   SAJJAD  963613062    17.27

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
sort یک ستون به ترتیبی که میخواهیم با استفاده از یک لیست انجام میگیرد.

In [91]:
list = ['a','b','c']
df['name'] = pd.Categorical(df['name'],categories = list, ordered = True)
df.sort_values('name')

  name stu_number  average
0  NaN  963613060    19.68
1  NaN  963613061    19.90
2  NaN  963613062    17.27
3  NaN  963613063    19.50
4  NaN  963613064    15.90
5  NaN  963613065    18.20
6  NaN  933613080    19.34

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای مرتب کردن بر اساس چند ستون، اسامی ستونها را در یک لیست قرار میدهیم. نوع ascending  هم در یک لیست در مقابل پارامتر مربوطه میگذاریم.

In [92]:
stu_dictionary = {
    "name" : ["parsa", "parsa", "ali", "hadi", "ali", "ghazale", "hamed"] ,
    "stu_number" : ["963613060", "963613061", "963613062", "963613063", "963613064", "963613065", "933613080"] ,
    "average" : [19.68,19.90,17.27, 19.5, 15.9, 18.2, 19.34]
}
df = pd.DataFrame(stu_dictionary)
df

      name stu_number  average
0    parsa  963613060    19.68
1    parsa  963613061    19.90
2      ali  963613062    17.27
3     hadi  963613063    19.50
4      ali  963613064    15.90
5  ghazale  963613065    18.20
6    hamed  933613080    19.34

In [93]:
df.sort_values(by=['name','average'],ascending=[True,False])

      name stu_number  average
2      ali  963613062    17.27
4      ali  963613064    15.90
5  ghazale  963613065    18.20
3     hadi  963613063    19.50
6    hamed  933613080    19.34
1    parsa  963613061    19.90
0    parsa  963613060    19.68

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
* اگر بخواهیم بر اساس اندیس مرتب کنیم از sort_index استفاده میکنیم.

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
ادغام دیتافریم ها    </font>
</div>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای ادغام دو دیتافریم از تابع pd.merge استفاده میکنیم.

In [94]:
import pandas as pd
import numpy as np
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "Blue", "White", "Blue", "Red"],
    "HP" :[48, 48, 48, 335, 335, 93, 93, 93, 93],
    "Weight (KG)" :[990, 990, 990, 2320, 2320, 1540, 1540, 1540, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1375, 1383, 1375, 1389]
}

cars_df = pd.DataFrame(cars_dictionary,
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
cars_df

               model     Color   HP  Weight (KG)  year
14234         Peykan       Red   48          990  1346
44234         Peykan     White   48          990  1357
22312         Peykan     Olive   48          990  1388
42348         BMW X6     Black  335         2320  1391
16373         BMW X6  Ametrine  335         2320  1393
38561  Nissan Junior      Blue   93         1540  1375
58193  Nissan Junior     White   93         1540  1383
85612  Nissan Junior      Blue   93         1540  1375
62471  Nissan Junior       Red   93         1540  1389

In [95]:
price_dictionary = {
    "model" : ["Peykan", "BMW X6", "Nissan Junior"],
    "price" : [40, 5200, 150]
}
price_df = pd.DataFrame(price_dictionary)
price_df

           model  price
0         Peykan     40
1         BMW X6   5200
2  Nissan Junior    150

In [96]:
pd.merge(cars_df, price_df)

           model     Color   HP  Weight (KG)  year  price
0         Peykan       Red   48          990  1346     40
1         Peykan     White   48          990  1357     40
2         Peykan     Olive   48          990  1388     40
3         BMW X6     Black  335         2320  1391   5200
4         BMW X6  Ametrine  335         2320  1393   5200
5  Nissan Junior      Blue   93         1540  1375    150
6  Nissan Junior     White   93         1540  1383    150
7  Nissan Junior      Blue   93         1540  1375    150
8  Nissan Junior       Red   93         1540  1389    150

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
ستون جدیدی با نام price، به دیتافریم اضافه شده و اطلاعات مربوط هر ماشین را با تطبیق دادن ستون model قیمت گذاری کرده است. دقت کنید که در این حالت، خود تابع pd.merge، با پیدا کردن ستونی که نام مشترکی در هر دو دیتافریم داشت (model) این ستون را به عنوان کلید برای ادغام انتخاب کرده است.

<img src='./2.pandas_file/04.jpg'>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
    اگر اندیس یکی از دیتافریم ها چیزی غیر از 0 تا n  باشد، آنرا حذف میکند و مجدد از 0 تا n اندیس گذاری میکند. در نتیجه عد از انجام ادغام، نمایه‌ها ریست شده و تمامی اطلاعات خود را از دست می‌دهند.* برای جلوگیری از حذف اندیس میتوانیم قبل از merge، آن دیتافریم را بازنویسی کنیم و اندیس را به عنوان ستون قرار دهیم و اندیس جدید 0 تا n تعریف کنیم.
    <br>
    برای این کار از تابع reset_index استفاده میکنیم.

In [97]:
new_df = cars_df.reset_index()
new_df

   index          model     Color   HP  Weight (KG)  year
0  14234         Peykan       Red   48          990  1346
1  44234         Peykan     White   48          990  1357
2  22312         Peykan     Olive   48          990  1388
3  42348         BMW X6     Black  335         2320  1391
4  16373         BMW X6  Ametrine  335         2320  1393
5  38561  Nissan Junior      Blue   93         1540  1375
6  58193  Nissan Junior     White   93         1540  1383
7  85612  Nissan Junior      Blue   93         1540  1375
8  62471  Nissan Junior       Red   93         1540  1389

In [98]:
pd.merge(new_df, price_df)

   index          model     Color   HP  Weight (KG)  year  price
0  14234         Peykan       Red   48          990  1346     40
1  44234         Peykan     White   48          990  1357     40
2  22312         Peykan     Olive   48          990  1388     40
3  42348         BMW X6     Black  335         2320  1391   5200
4  16373         BMW X6  Ametrine  335         2320  1393   5200
5  38561  Nissan Junior      Blue   93         1540  1375    150
6  58193  Nissan Junior     White   93         1540  1383    150
7  85612  Nissan Junior      Blue   93         1540  1375    150
8  62471  Nissan Junior       Red   93         1540  1389    150

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر ستونها اسم مشترک نداشتند در دستور merge باید مشخص کنیم که از کدام دیتافریم کدام ستون را در نظر بگیرد.

In [99]:
price_dictionary2 = {
    "car model" : ["Peykan", "BMW X6", "Nissan Junior"],
    "price" : [40, 5200, 150]
}
price_df2 = pd.DataFrame(price_dictionary2)
price_df2

       car model  price
0         Peykan     40
1         BMW X6   5200
2  Nissan Junior    150

In [100]:
merged = pd.merge(cars_df, price_df2, left_on = "model", right_on = "car model") 
merged

           model     Color   HP  Weight (KG)  year      car model  price
0         Peykan       Red   48          990  1346         Peykan     40
1         Peykan     White   48          990  1357         Peykan     40
2         Peykan     Olive   48          990  1388         Peykan     40
3         BMW X6     Black  335         2320  1391         BMW X6   5200
4         BMW X6  Ametrine  335         2320  1393         BMW X6   5200
5  Nissan Junior      Blue   93         1540  1375  Nissan Junior    150
6  Nissan Junior     White   93         1540  1383  Nissan Junior    150
7  Nissan Junior      Blue   93         1540  1375  Nissan Junior    150
8  Nissan Junior       Red   93         1540  1389  Nissan Junior    150

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
در این حالت، به دلیل متفاوت بودن نام کلیدها هر دوی آن‌ها در نتیجه‌ی نهایی ظاهر شده‌اند. برای حذف یکی از تابع drop کمک میگیریم.

In [101]:
merged.drop(columns = ["car model"])

           model     Color   HP  Weight (KG)  year  price
0         Peykan       Red   48          990  1346     40
1         Peykan     White   48          990  1357     40
2         Peykan     Olive   48          990  1388     40
3         BMW X6     Black  335         2320  1391   5200
4         BMW X6  Ametrine  335         2320  1393   5200
5  Nissan Junior      Blue   93         1540  1375    150
6  Nissan Junior     White   93         1540  1383    150
7  Nissan Junior      Blue   93         1540  1375    150
8  Nissan Junior       Red   93         1540  1389    150

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
استفاده از چند کلید برای ادغام

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای آنکه بیشتر از یک ستون را به عنوان کلید در نظر بگیریم، از پارامترهای left_on , right_on کمک میگیریم و اسامی ستون ها را به صورت لیست در مقابل پارامترها مینویسیم.

In [102]:
price_with_year_dictionary = {
    "year" :[1346, 1357, 1388, 1391, 1393,  1375, 1383, 1389],
    "car model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "price" :[25, 30, 48, 2200, 4800, 105, 130, 155]
}

price_with_year_df = pd.DataFrame(price_with_year_dictionary)
price_with_year_df

   year      car model  price
0  1346         Peykan     25
1  1357         Peykan     30
2  1388         Peykan     48
3  1391         BMW X6   2200
4  1393         BMW X6   4800
5  1375  Nissan Junior    105
6  1383  Nissan Junior    130
7  1389  Nissan Junior    155

In [103]:
pd.merge(cars_df, price_with_year_df, left_on = ["model" , "year"], right_on = ["car model", "year"])

           model     Color   HP  Weight (KG)  year      car model  price
0         Peykan       Red   48          990  1346         Peykan     25
1         Peykan     White   48          990  1357         Peykan     30
2         Peykan     Olive   48          990  1388         Peykan     48
3         BMW X6     Black  335         2320  1391         BMW X6   2200
4         BMW X6  Ametrine  335         2320  1393         BMW X6   4800
5  Nissan Junior      Blue   93         1540  1375  Nissan Junior    105
6  Nissan Junior      Blue   93         1540  1375  Nissan Junior    105
7  Nissan Junior     White   93         1540  1383  Nissan Junior    130
8  Nissan Junior       Red   93         1540  1389  Nissan Junior    155

<img src='./2.pandas_file/05.jpg'>

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر ستونی که به عنوان کلید میخواستیم استفاده کنیم به صورت اندیس در دیتافریم آمده بود، از پارامترهای left_index , right_index استفاده میکنیم. این پارامترها در حالت پیش فرض مقدار False دارند، برای این حالت باید مقدار آنها True بشود.

In [104]:
price_dictionary3 = {
    "HP" :[40, 330, 87],
    "price" :[48, 2200, 105]
}

price_df3 = pd.DataFrame(price_dictionary3,
                        index = ["Peykan", "BMW X6", "Nissan Junior"])
price_df3

                HP  price
Peykan          40     48
BMW X6         330   2200
Nissan Junior   87    105

In [105]:
pd.merge(cars_df, price_df3, left_on = "model" , right_index = True)

               model     Color  HP_x  Weight (KG)  year  HP_y  price
14234         Peykan       Red    48          990  1346    40     48
44234         Peykan     White    48          990  1357    40     48
22312         Peykan     Olive    48          990  1388    40     48
42348         BMW X6     Black   335         2320  1391   330   2200
16373         BMW X6  Ametrine   335         2320  1393   330   2200
38561  Nissan Junior      Blue    93         1540  1375    87    105
58193  Nissan Junior     White    93         1540  1383    87    105
85612  Nissan Junior      Blue    93         1540  1375    87    105
62471  Nissan Junior       Red    93         1540  1389    87    105

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
دیتافریمی که این بار برای قیمت استفاده کردیم، دارای اطلاعات HP یا همان اسب بخار ماشین نیز می‌شد. در این حالت، پانداس برای نگه‌ داشتن هر دو این ستون‌ها به آن‌ها پسوند‌هایی را اختصاص داده است. در حالتی که ستون تکراری داریم، می‌توانیم با استفاده از دستور drop، یکی از آن‌ها را حذف کنیم. اما اگر به مقادیر دقت کنید، متوجه متفاوت بودن این ستون‌ها می‌شوید. برای تعیین پسوند این ستونها، از پارامتر suffixes استفاده می‌کنیم.

In [106]:
pd.merge(cars_df, price_df3, left_on = "model" , right_index = True, suffixes=('_gallery', '_web'))

               model     Color  HP_gallery  Weight (KG)  year  HP_web  price
14234         Peykan       Red          48          990  1346      40     48
44234         Peykan     White          48          990  1357      40     48
22312         Peykan     Olive          48          990  1388      40     48
42348         BMW X6     Black         335         2320  1391     330   2200
16373         BMW X6  Ametrine         335         2320  1393     330   2200
38561  Nissan Junior      Blue          93         1540  1375      87    105
58193  Nissan Junior     White          93         1540  1383      87    105
85612  Nissan Junior      Blue          93         1540  1375      87    105
62471  Nissan Junior       Red          93         1540  1389      87    105

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
انواع ادغام

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در ادغام دو دیتافریم اگر ستونهایی که به عنوان کلید نام میبریم در دو دیتافریم شبیه هم نباشند، پس از ادغام در حالت پیش فرض فقط ردیف های مشترک آورده میشوند. برای آنکه از حذف یک سری اطلاعات جلوگیری کنیم و نوع ادغام دیتافریمها را تعیین کنیم از پارامتر how استفاده میکنیم.
    <br>
    چهار نوع ادغام (join) داریم:

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
<font face="vazir" size=3>
        
| join| توضیحات|
| ------------ |-------- |
| inner| تنها مقادیری از کلیدها در نتیجه نهایی ظاهر می‌شود که در هر دو جدول دیده شده باشند.|
| outer| تمامی مقادیر کلید‌ها در نتیجه ظاهر می‌شوند و برای مقادیری که یکی از دو جدول مقدار ندارد NaN در نظر گرفته می‌شود.|
| left| فقط مقادیر کلید جدول سمت چپ در نظر گرفته می‌شود.|
| right| فقط مقادیر کلید جدول سمت راست در نظر گرفته می‌شود.|

<img src='./2.pandas_file/06.jpg'>

In [107]:
full_cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "Nissan Junior", "Pride 131", "Pride 131"],
    "Color" :["Red", "White", "Olive", "White", "Black", "Ametrine", "Blue"],
    "HP" :[48, 48, 48, 335, 93, 71, 71],
    "Weight (KG)" :[990, 990, 990, 2320, 1540, 915, 915]
}

full_cars_df = pd.DataFrame(full_cars_dictionary)
full_cars_df

           model     Color   HP  Weight (KG)
0         Peykan       Red   48          990
1         Peykan     White   48          990
2         Peykan     Olive   48          990
3         BMW X6     White  335         2320
4  Nissan Junior     Black   93         1540
5      Pride 131  Ametrine   71          915
6      Pride 131      Blue   71          915

In [108]:
full_price_dictionary = {
    "model" :["Peykan", "BMW X6", "Nissan Junior", "Dena"],
    "price" :[37, 4800, 105, 380]
}

full_price_df = pd.DataFrame(full_price_dictionary)
full_price_df

           model  price
0         Peykan     37
1         BMW X6   4800
2  Nissan Junior    105
3           Dena    380

In [109]:
pd.merge(full_cars_df, full_price_df)

           model  Color   HP  Weight (KG)  price
0         Peykan    Red   48          990     37
1         Peykan  White   48          990     37
2         Peykan  Olive   48          990     37
3         BMW X6  White  335         2320   4800
4  Nissan Junior  Black   93         1540    105

<img src='./2.pandas_file/07.jpg'>

In [110]:
pd.merge(full_cars_df, full_price_df, how = "left")

           model     Color   HP  Weight (KG)   price
0         Peykan       Red   48          990    37.0
1         Peykan     White   48          990    37.0
2         Peykan     Olive   48          990    37.0
3         BMW X6     White  335         2320  4800.0
4  Nissan Junior     Black   93         1540   105.0
5      Pride 131  Ametrine   71          915     NaN
6      Pride 131      Blue   71          915     NaN

<img src='./2.pandas_file/08.jpg'>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
توابع اتصال و هم‌پوشانی

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای اتصال دو دیتافریم علاوه بر تابع append از تابع دیگری به نام concat میتوانیم استفاده کنیم.  
    <br>
    پارامتر axis مشخص کننده چگونه قرار گرفتن دو دیتافریم است. اگر axis=0 باشد، سطرهای df2 زیر سطرهای df1 اضافه میشوند. 
    <br>
   * برای مقادیری که در دیتافریم دوم موجود نیستند مقدار NaN (Not a Number) را در نظر می‌گیرد.

In [111]:
dictionary1 = {
    "model" :["Peykan", "Peykan", "BMW X6", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red","Olive", "Ametrine", "White", "Red"],
    "HP" :[48, 48, 335, 93, 93],
    "Weight (KG)" :[990, 990, 2320, 1540, 1540],
    "year" :[1346, 1388, 1393, 1383, 1389]
}
df1 = pd.DataFrame(dictionary1)
df1

           model     Color   HP  Weight (KG)  year
0         Peykan       Red   48          990  1346
1         Peykan     Olive   48          990  1388
2         BMW X6  Ametrine  335         2320  1393
3  Nissan Junior     White   93         1540  1383
4  Nissan Junior       Red   93         1540  1389

In [112]:
dictionary2 = {
    "model" :["Peykan", "BMW X6", "Nissan Junior", "Nissan Junior"],
    "Color" :["White", "Black", "Blue", "Blue"],
    "Weight (KG)" :[990, 2320, 1540, 1540],
    "year" :[1357, 1391, 1375, 1375]
}
df2 = pd.DataFrame(dictionary2)
df2

           model  Color  Weight (KG)  year
0         Peykan  White          990  1357
1         BMW X6  Black         2320  1391
2  Nissan Junior   Blue         1540  1375
3  Nissan Junior   Blue         1540  1375

In [113]:
a = pd.concat([df1, df2], axis=0)
a

           model     Color     HP  Weight (KG)  year
0         Peykan       Red   48.0          990  1346
1         Peykan     Olive   48.0          990  1388
2         BMW X6  Ametrine  335.0         2320  1393
3  Nissan Junior     White   93.0         1540  1383
4  Nissan Junior       Red   93.0         1540  1389
0         Peykan     White    NaN          990  1357
1         BMW X6     Black    NaN         2320  1391
2  Nissan Junior      Blue    NaN         1540  1375
3  Nissan Junior      Blue    NaN         1540  1375

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
این تابع بدون تغییر نمایه‌ها دقیقا دو دیتافریم را به هم چسبانده است. برای آنکه نمایه ها را به حالت استاندارد بین 0 تا n-1 برگردانیم، از تابع reset_index استفاده میکنیم و ستون اندیس قبلی را با دستور drop حذف میکنیم.

In [114]:
a.reset_index().drop(columns=['index'])

           model     Color     HP  Weight (KG)  year
0         Peykan       Red   48.0          990  1346
1         Peykan     Olive   48.0          990  1388
2         BMW X6  Ametrine  335.0         2320  1393
3  Nissan Junior     White   93.0         1540  1383
4  Nissan Junior       Red   93.0         1540  1389
5         Peykan     White    NaN          990  1357
6         BMW X6     Black    NaN         2320  1391
7  Nissan Junior      Blue    NaN         1540  1375
8  Nissan Junior      Blue    NaN         1540  1375

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
میتوانیم برای حذف اندیس قبلی و جایگزینی اندیس جدید از پارامتر inplace , drop هم استفاده کنیم و مقدار آنها را برابر True قرار دهیم.

In [115]:
b = pd.concat([df1, df2], axis=0)
b.reset_index(inplace=True,drop=True)
b

           model     Color     HP  Weight (KG)  year
0         Peykan       Red   48.0          990  1346
1         Peykan     Olive   48.0          990  1388
2         BMW X6  Ametrine  335.0         2320  1393
3  Nissan Junior     White   93.0         1540  1383
4  Nissan Junior       Red   93.0         1540  1389
5         Peykan     White    NaN          990  1357
6         BMW X6     Black    NaN         2320  1391
7  Nissan Junior      Blue    NaN         1540  1375
8  Nissan Junior      Blue    NaN         1540  1375

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر axis=1 باشد، ستونهای df2 کنار ستونهای df1 اضافه خواهند شد.

In [116]:
dictionary1 = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "Blue", "White", "Blue", "Red"],
    "HP" :[48, 48, 48, 335, 335, 93, 93, 93, 93]
}
df_1 = pd.DataFrame(dictionary1)
df_1

           model     Color   HP
0         Peykan       Red   48
1         Peykan     White   48
2         Peykan     Olive   48
3         BMW X6     Black  335
4         BMW X6  Ametrine  335
5  Nissan Junior      Blue   93
6  Nissan Junior     White   93
7  Nissan Junior      Blue   93
8  Nissan Junior       Red   93

In [117]:
dictionary2 = {
    "Weight (KG)" :[990, 990, 990, 2320, 2320, 1540, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1375, 1383]
}
df_2 = pd.DataFrame(dictionary2)
df_2

   Weight (KG)  year
0          990  1346
1          990  1357
2          990  1388
3         2320  1391
4         2320  1393
5         1540  1375
6         1540  1383

In [118]:
pd.concat([df1, df2], axis=1)

,model,Color,HP,Weight (KG),year,model,Color,Weight (KG),year
0,Peykan,Red,48,990,1346,Peykan,White,990.0,1357.0
1,Peykan,Olive,48,990,1388,BMW X6,Black,2320.0,1391.0
2,BMW X6,Ametrine,335,2320,1393,Nissan Junior,Blue,1540.0,1375.0
3,Nissan Junior,White,93,1540,1383,Nissan Junior,Blue,1540.0,1375.0
4,Nissan Junior,Red,93,1540,1389,NaN,NaN,NaN,NaN

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
هم‌پوشانی (overlap)

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر دو دیتافریم به صورتی باشند که اطلاعاتی مشترک داشته باشند و همپوشانی کنند و اطلاعات دیتافریم اول برای ما ارجحیت داشته باشد، از تابع combine_first استفاده میکنیم. این تابع جاهای خالی دیتافریم اول را با اطلاعات دیتافریم دوم پر میکند و در مواردی که دو دیتافریم اطلاعات متناقض دارند، اطلاعات دیتافریم اول را نگه میدارد.

In [119]:
staff1_dictionary = {
    "model" :["Peykan", np.nan, "Peykan", "BMW X6", "BMW X6", np.nan, "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", np.nan, "Blue", "White", "Blue", "Red"],
    "HP" :[48, np.nan, 48, 335, 335, np.nan, 93, np.nan, 93],
    "Weight (KG)" :[np.nan, 990, 990, 2320, np.nan, 1540, 1540, 1540, np.nan],
    "year" :[1346, np.nan, 1388, 1391, 1393, 1375, np.nan, 1375, 1389]
}

staff1_df = pd.DataFrame(staff1_dictionary, 
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
staff1_df

               model  Color     HP  Weight (KG)    year
14234         Peykan    Red   48.0          NaN  1346.0
44234            NaN  White    NaN        990.0     NaN
22312         Peykan  Olive   48.0        990.0  1388.0
42348         BMW X6  Black  335.0       2320.0  1391.0
16373         BMW X6    NaN  335.0          NaN  1393.0
38561            NaN   Blue    NaN       1540.0  1375.0
58193  Nissan Junior  White   93.0       1540.0     NaN
85612  Nissan Junior   Blue    NaN       1540.0  1375.0
62471  Nissan Junior    Red   93.0          NaN  1389.0

In [120]:
staff2_dictionary = {
    "model" :[np.nan, "Peykan", "Peykan", np.nan, "BMW X5", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Green",  "Black", "Ametrine", np.nan, "Gray", "Navy", np.nan],
    "HP" :[48, 48, 48, np.nan, 335, 93, np.nan, 93, 93],
    "Weight (KG)" :[np.nan, 990, 990, np.nan, 2320, 1540, 1540, 1540, np.nan],
    "year" :[np.nan, 1357, 1388, 1391, 1393, 1375, 1383, np.nan, 1389]
}

staff2_df = pd.DataFrame(staff2_dictionary, 
                      index = [14234, 44234, 22312, 42348, 16373, 38561, 58193, 85612, 62471])
staff2_df

               model     Color     HP  Weight (KG)    year
14234            NaN       Red   48.0          NaN     NaN
44234         Peykan     White   48.0        990.0  1357.0
22312         Peykan     Green   48.0        990.0  1388.0
42348            NaN     Black    NaN          NaN  1391.0
16373         BMW X5  Ametrine  335.0       2320.0  1393.0
38561  Nissan Junior       NaN   93.0       1540.0  1375.0
58193  Nissan Junior      Gray    NaN       1540.0  1383.0
85612  Nissan Junior      Navy   93.0       1540.0     NaN
62471  Nissan Junior       NaN   93.0          NaN  1389.0

In [121]:
staff1_df.combine_first(staff2_df)

               model     Color     HP  Weight (KG)    year
14234         Peykan       Red   48.0          NaN  1346.0
44234         Peykan     White   48.0        990.0  1357.0
22312         Peykan     Olive   48.0        990.0  1388.0
42348         BMW X6     Black  335.0       2320.0  1391.0
16373         BMW X6  Ametrine  335.0       2320.0  1393.0
38561  Nissan Junior      Blue   93.0       1540.0  1375.0
58193  Nissan Junior     White   93.0       1540.0  1383.0
85612  Nissan Junior      Blue   93.0       1540.0  1375.0
62471  Nissan Junior       Red   93.0          NaN  1389.0

<img src='./2.pandas_file/09.jpg'>

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
گروه بندی

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با کمک تابع groupby می‌توانیم داده‌ها را بر اساس کلیدهای مختلف، گروه‌بندی کرده، و نتایجی را بر اساس هر گروه به دست آوریم.

In [122]:
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "navy", "Blue", "White", "Blue", "Red"],
    "Weight (KG)" :[990, 1000, 990, 2320, 2320, 2220, 1540, 1540, 1600, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1393, 1375, 1383, 1375, 1389],
    "price" :[25, 30, 48, 2200, 4800, 4800, 105, 105, 130, 145]
}

cars_df = pd.DataFrame(cars_dictionary)
cars_df

           model     Color  Weight (KG)  year  price
0         Peykan       Red          990  1346     25
1         Peykan     White         1000  1357     30
2         Peykan     Olive          990  1388     48
3         BMW X6     Black         2320  1391   2200
4         BMW X6  Ametrine         2320  1393   4800
5         BMW X6      navy         2220  1393   4800
6  Nissan Junior      Blue         1540  1375    105
7  Nissan Junior     White         1540  1383    105
8  Nissan Junior      Blue         1600  1375    130
9  Nissan Junior       Red         1540  1389    145

In [123]:
grouped = cars_df.groupby('model')
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
داده‌ساختار DataFrameGroupBy برای نگه داری اطلاعات گروه‌بندی شده‌ی دیتافریم‌ها به کار می‌رود.

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
متد‌ها و ویژگی‌های ساختار گروه‌بندی

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
با اجرای کد cars_df.groupby('model')، داده‌ها بر اساس نام مدل گروه‌بندی می‌شوند؛ حال با ویژگی ngroups، می‌توانیم تعداد گروه‌های موجود در این داده ساختار را بدست آوریم.

In [124]:
grouped.ngroups

3

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در صورتی که بخواهیم از نام گروه‌ها و اعضای آن‌ها مطلع شویم می‌توانیم از ویژگی groups استفاده کنیم.

In [125]:
grouped.groups

{'BMW X6': [3, 4, 5], 'Nissan Junior': [6, 7, 8, 9], 'Peykan': [0, 1, 2]}

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
نام هر مدل به عنوان کلید، و نمایه‌ی سطرهای مربوط به آن گروه روبه‌روی آن‌ها ذکر شده است.

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای فهمیدن تعداد اعضای هر گروه، از متد size() استفاده می‌کنیم.

In [126]:
grouped.size()

model
BMW X6           3
Nissan Junior    4
Peykan           3
dtype: int64

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
اعمال توابع روی گروه‌ها

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
به طور کلی توابعی که می‌توان براساس گروه‌بندی اعمال کرد، به سه دسته‌ی زیر تقسیم می‌شوند:
    <br>
１- تجمیع (aggregation): این توابع، برای تمامی اعضای هر گروه، تنها یک مقدار را بدست آورده و به کلید آن نسبت می‌دهند. مانند میانگین، مجموع و ...
    <br>
２- تبدیل (transform): این توابع، تغییراتی را با توجه به دیگر داده‌های دسته روی هر داده اعمال می‌کنند. مانند نرمال‌سازی درون دسته‌ای.
    <br>
３- فیلتر (filter): حذف برخی داده‌ها با توجه به اطلاعات دیگر اعضای گروه. مثلا حذف داده‌هایی که مقداری کمتر از میانگین دارند.

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='gold'>
1) تجمیع

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
به طور کلی، این توابع در سه مرحله‌ی تقسیم، اعمال و ترکیب (split-apply-combine) انجام می‌شوند:
    <br>
１- ابتدا با استفاده از تابع groupby، دیتافریم اولیه با توجه به کلید تقسیم و دسته‌بندی می‌شود.
    <br>
２- سپس تابعی از نوع تجمیع روی هر گروه اعمال می‌شود تا برای هر گروه مقدار ثابتی را تولید کند.
    <br>
３- مقادیر خروجی گروه‌ها با هم ترکیب شده و دیتافریم جدیدی که نمایه‌های آن، مقادیر کلید گروه‌بندی هستند، تولید می‌شود.
    <br>
برای اعمال توابع تجمیع، کافی است از متد agg() استفاده کنیم و تابع مورد نظر را به عنوان ورودی این متد بدهیم:

In [127]:
grouped[['price','Weight (KG)']].agg('mean')

                     price  Weight (KG)
model
BMW X6         3933.333333  2286.666667
Nissan Junior   121.250000  1555.000000
Peykan           34.333333   993.333333

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر تابع تجمیعی یک تابع Built-in پانداس باشد، میتوانیم به صورت مستقیم هم به grouped اعمال کنیم.

In [128]:
grouped[['price','Weight (KG)']].mean()

                     price  Weight (KG)
model
BMW X6         3933.333333  2286.666667
Nissan Junior   121.250000  1555.000000
Peykan           34.333333   993.333333

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر لازم باشد یک تابع بنویسیم تا مقدار تجمیعی مورد نظر ما را حساب کند، این تابع را تعریف میکنیم و بدون استفاده از '' درون تابع agg صدا میزنیم.

In [129]:
 def peak_to_peak(arr):
     return arr.max() - arr.min()

grouped[['price','Weight (KG)']].agg( peak_to_peak )

               price  Weight (KG)
model
BMW X6          2600          100
Nissan Junior     40           60
Peykan            23           10

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
میتوانیم همزمان چند تابع به متد agg برای اعمال روی یک ستون بدهیم. برای این کار توابع را به صورت لیست می آوریم.

In [130]:
grouped['price'].agg(['count', peak_to_peak, 'median', 'mean'])

               count  peak_to_peak  median         mean
model
BMW X6             3          2600  4800.0  3933.333333
Nissan Junior      4            40   117.5   121.250000
Peykan             3            23    30.0    34.333333

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
اگر بخواهیم توابع مختلف روی ستونهای مختلف اعمال کنیم از دیکشنری کمک میگیریم.
    <br>
    (گروه بندی بر اساس مدل، محاسبه تابع peak_to_peak برای قیمت و تابع mean برای Weight (KG): )

In [131]:
cars_df.groupby('model').agg({'price':peak_to_peak, 'Weight (KG)':'mean'})

               price  Weight (KG)
model
BMW X6          2600  2286.666667
Nissan Junior     40  1555.000000
Peykan            23   993.333333

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
برای تغییر نام ستون ها از متد rename استفاده میکنیم.

In [132]:
cars_df.groupby('model').agg({'price':peak_to_peak, 'Weight (KG)':'mean'}).rename(columns={'price':'price peak_to_peak', 'Weight (KG)':'weight mean'})

               price peak_to_peak  weight mean
model
BMW X6                       2600  2286.666667
Nissan Junior                  40  1555.000000
Peykan                         23   993.333333

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=5 color='gold'>
2) تبدیل

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای اضافه کردن یک ستون با مقادیر محاسبه شده بر اساس سایر ستونها میتونیم از تابع transform استفاده کنیم و با پارامتر lambda تابع را تعریف کنیم.تابعی که به صورت lambda نوشته شده است، برای هر گروه یکبار انجام میشود.

In [133]:
df_copy = cars_df.copy()
df_copy['percent'] = df_copy.groupby('model')['price'].transform(lambda x: ((x-x.min())/(x.max()-x.min()))*100)
df_copy

           model     Color  Weight (KG)  year  price    percent
0         Peykan       Red          990  1346     25    0.00000
1         Peykan     White         1000  1357     30   21.73913
2         Peykan     Olive          990  1388     48  100.00000
3         BMW X6     Black         2320  1391   2200    0.00000
4         BMW X6  Ametrine         2320  1393   4800  100.00000
5         BMW X6      navy         2220  1393   4800  100.00000
6  Nissan Junior      Blue         1540  1375    105    0.00000
7  Nissan Junior     White         1540  1383    105    0.00000
8  Nissan Junior      Blue         1600  1375    130   62.50000
9  Nissan Junior       Red         1540  1389    145  100.00000

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=5 color='gold'>
3) فیلتر

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر بخواهیم با فیلتر کردن برخی نمونه های دیتافریم را حذف کنیم، از تابع filter استفاده میکنیم. تابع تعریف شده با lambda را اعمال میکند و نمونه هایی که این تابع برایشان True باشد برمیگرداند.

In [134]:
# می‌خواهیم تنها اطلاعات ماشین‌هایی را نگه داریم که از آن مدل حداقل ۴ نمونه داشته باشیم.
cars_df.groupby('model').filter(lambda x : len(x) >= 4)

           model  Color  Weight (KG)  year  price
6  Nissan Junior   Blue         1540  1375    105
7  Nissan Junior  White         1540  1383    105
8  Nissan Junior   Blue         1600  1375    130
9  Nissan Junior    Red         1540  1389    145

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
انواع کلید برای گروه‌بندی

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=5 color='gold'>
استفاده از آرایه به عنوان کلید

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
یک ستون جدید تعریف میکنیم (مثلا میزان خوردگی ماشین ها) حال میخواهیم min , max قیمت را با توجه به آن بدانیم. (کلید را با () جلوی groupby قرار میدهیم.)

In [135]:
car_impact = ['low', 'high', 'medium', 'high', 'low', 'medium', 'medium', 'low', 'low', 'high']
cars_df.groupby(car_impact)['price'].agg(['min', 'max'])

        min   max
high     30  2200
low      25  4800
medium   48  4800

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=5 color='gold'>
استفاده از تابع به عنوان کلید

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
یک تابع تعریف میکنیم و میخواهیم از خروجی تابع به عنوان کلید استفاده کنیم. مانند حالت بالا آن را در () مقابل groupby قرار میدهیم.
    <br>
    مثلا میخواهیم سال را از روی شماره فاکتور پیدا کنیم و به عنوان کلید استفاده کنیم و عملیات جمع را برای هر سال روی قیمت انجام دهیم.

In [136]:
cars_df.index = [3523, 2636, 1031, 2159, 2973, 1083, 3214, 1111, 2525, 2445]

# تابعی برای پیدا کردن سال خرید ماشین
def factor_split(number):
    return np.array(number/1000).astype(int)

factor_split(cars_df.index)

array([3, 2, 1, 2, 2, 1, 3, 1, 2, 2])

In [137]:
cars_df.groupby(factor_split)['price'].sum()

1    4953
2    7305
3     130
Name: price, dtype: int64

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=5 color='gold'>
استفاده از چند کلید برای گروه‌بندی

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در این حالت کلیدها را به صورت لیست در  مقابل groupby قرار میدهیم.
    <br>
    مثلا میخواهیم میانگین قیمت هر ماشین را بر اساس مدل و سال بدست آوریم. در این حالت هم مدل و هم سال، همزمان به عنوان نمایه شناخته میشوند.

In [138]:
price_datas = cars_df.groupby(['model', 'year'])['price'].mean()
price_datas

model          year
BMW X6         1391    2200.0
               1393    4800.0
Nissan Junior  1375     117.5
               1383     105.0
               1389     145.0
Peykan         1346      25.0
               1357      30.0
               1388      48.0
Name: price, dtype: float64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
اگر از تابع unstack استفاده کنیم دومین نمایه به عنوان ستون در نظر گرفته میشود و یک جدول خواهیم داشت.

In [139]:
price_datas.unstack()

year           1346  1357   1375   1383  1388   1389    1391    1393
model
BMW X6          NaN   NaN    NaN    NaN   NaN    NaN  2200.0  4800.0
Nissan Junior   NaN   NaN  117.5  105.0   NaN  145.0     NaN     NaN
Peykan         25.0  30.0    NaN    NaN  48.0    NaN     NaN     NaN

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
نکات تکمیلی

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
تبدیل نوع داده

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
 با دستور convert_dtype میتوانیم نوع داده را به صورت خودکار تبدیل کنیم. در این حالت کل df تحت دستور تغییر خواهد کرد. مثلا داده هایی که object هستند، اگر شبیه string باشند به string تغییر میکنند. اگر شبیه False/True باشند به boolean تغییر میکنند. میتوان به این دستور پاراکتر هم داد.

In [140]:
cars_dictionary = {
    "model" :[ "Peykan", "BMW X6", "Peugeot 206", "Tiba", "Nissan Junior", "Peykan Vanet", "renault 5"],
    "Color" :["Red", "White", "Black", "White", "Blue", "Red", "Silver"],
    "HP" :[48, 335, 105, 87, 93, 80, 48],
    "Weight (KG)": [990, 2320, 1025, 1027, 1540, 960, 850],
    "price" :[33, 2400, 105, 120, 230, 68, 38]
}

df = pd.DataFrame(cars_dictionary)

df

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

In [141]:
df.convert_dtypes(infer_objects=True, convert_string=True, convert_integer=True, convert_boolean=True, convert_floating=True)

           model   Color   HP  Weight (KG)  price
0         Peykan     Red   48          990     33
1         BMW X6   White  335         2320   2400
2    Peugeot 206   Black  105         1025    105
3           Tiba   White   87         1027    120
4  Nissan Junior    Blue   93         1540    230
5   Peykan Vanet     Red   80          960     68
6      renault 5  Silver   48          850     38

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای convert نوع یک ستون از دستور astype() استفاده میکنیم.

In [142]:
df['HP'].astype('string')

0     48
1    335
2    105
3     87
4     93
5     80
6     48
Name: HP, dtype: string

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
تغییر مقدار ستون بر اساس یک شرط

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
برای تغییر مقدار یک ستون بر اساس یک شرط از دستور df.loc[condition,column_label]=new_value  استفاده میکنیم.

In [143]:
has_R = df['Color'].str.contains('R')
df.loc[has_R,'price']=df['price']*1.1
df

           model   Color   HP  Weight (KG)   price
0         Peykan     Red   48          990    36.3
1         BMW X6   White  335         2320  2400.0
2    Peugeot 206   Black  105         1025   105.0
3           Tiba   White   87         1027   120.0
4  Nissan Junior    Blue   93         1540   230.0
5   Peykan Vanet     Red   80          960    74.8
6      renault 5  Silver   48          850    38.0

<br>
<div dir=rtl id="start" style="direction:rtl;line-height:200%;">
	<font face="vazir" size=6 color='Orange'>
تابع map

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
نقشه اصطلاحی است که از ریاضیات وام گرفته شده است، برای تابعی که مجموعه ای از مقادیر را می گیرد و آنها را به مجموعه مقادیر دیگری "نقشه" می کند. در علم داده اغلب به ایجاد نمایش های جدید از داده های موجود یا تبدیل داده ها از قالبی که اکنون در آن است به قالبی که می خواهیم بعداً باشد نیاز داریم. نقشه ها هستند که این کار را انجام می دهند و آنها را برای انجام کار شما بسیار مهم می کند!
    <br>
دو روش نقشه برداری وجود دارد که اغلب از آنها استفاده خواهید کرد.

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
map() اولین و کمی ساده‌تر است. برای مثال، فرض کنید که میانگین وزن ماشینها را حساب کردیم و حالا می‌خواهیم وزنها را به 0 بازگردانیم. می‌توانیم این کار را به صورت زیر انجام دهیم:

In [145]:
cars_dictionary = {
    "model" :["Peykan", "Peykan", "Peykan", "BMW X6", "BMW X6", "BMW X6", "Nissan Junior", "Nissan Junior", "Nissan Junior", "Nissan Junior"],
    "Color" :["Red", "White", "Olive",  "Black", "Ametrine", "navy", "Blue", "White", "Blue", "Red"],
    "Weight" :[990, 1000, 990, 2320, 2320, 2220, 1540, 1540, 1600, 1540],
    "year" :[1346, 1357, 1388, 1391, 1393, 1393, 1375, 1383, 1375, 1389],
    "price" :[25, 30, 48, 2200, 4800, 4800, 105, 105, 130, 145]
}

cars_df = pd.DataFrame(cars_dictionary)
cars_df

           model     Color  Weight  year  price
0         Peykan       Red     990  1346     25
1         Peykan     White    1000  1357     30
2         Peykan     Olive     990  1388     48
3         BMW X6     Black    2320  1391   2200
4         BMW X6  Ametrine    2320  1393   4800
5         BMW X6      navy    2220  1393   4800
6  Nissan Junior      Blue    1540  1375    105
7  Nissan Junior     White    1540  1383    105
8  Nissan Junior      Blue    1600  1375    130
9  Nissan Junior       Red    1540  1389    145

In [146]:
cars_weight_mean = cars_df.Weight.mean()
cars_weight_mean

1606.0

In [147]:
cars_df.Weight.map(lambda p: p - cars_weight_mean)

0   -616.0
1   -606.0
2   -616.0
3    714.0
4    714.0
5    614.0
6    -66.0
7    -66.0
8     -6.0
9    -66.0
Name: Weight, dtype: float64

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=3 color='midnightblue'>
تابعی که به map() می‌فرستید باید یک مقدار را از سری انتظار داشته باشد (مقدار نقطه‌ای، در مثال بالا)، و یک نسخه تبدیل شده از آن مقدار را برگرداند. map() یک سری جدید را برمی گرداند که در آن تمام مقادیر توسط تابع شما تبدیل شده اند.

<p dir=rtl style="direction: rtl;text-align: right;line-height:200%;font-family:vazir;font-size:medium">
<font face="vazir" size=4>
در صورتی که بخواهیم کل DataFrame را با فراخوانی یک متد سفارشی در هر سطر تبدیل کنیم، apply متد معادل است.

In [148]:
def remean_weight(row):
    row.Weight = row.Weight - cars_weight_mean
    return row

cars_df.apply(remean_weight, axis='columns')

           model     Color  Weight  year  price
0         Peykan       Red  -616.0  1346     25
1         Peykan     White  -606.0  1357     30
2         Peykan     Olive  -616.0  1388     48
3         BMW X6     Black   714.0  1391   2200
4         BMW X6  Ametrine   714.0  1393   4800
5         BMW X6      navy   614.0  1393   4800
6  Nissan Junior      Blue   -66.0  1375    105
7  Nissan Junior     White   -66.0  1383    105
8  Nissan Junior      Blue    -6.0  1375    130
9  Nissan Junior       Red   -66.0  1389    145

<br>
<div dir=rtl id="start" style="direction:ltr;line-height:200%;">
	<font face="vazir" size=7 color='Red'>
The END
    </font>
</div>